Autodesk.Revit.DB.BuiltInFailures.SketchFailures.WrongFaceSplitterLoopTypesNum
Sketch for splitting the face is invalid.  Faces may be split either by a single closed loop that is contained within the face
or by one or more open loops whose ends lie on the boundary of the face.  None of the lines in the sketch are allowed to overlap
or intersect the boundaries of the face.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.WrongCutBoundaryLoops
Only open loops can be used for Edit Cut Profile. All open ends must lie on the boundary of the cut profile, and the loop may not
touch the boundary anywhere except at its ends.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.VarSketchInElementFailure
The constraints of the sketch defining the highlighted element cannot be satisfied.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.VarSketchFailure
Constraints defined by highlighted Lines and Dimensions can't be satisfied.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.UnsatisfiedWallAssocProp
Constraint between a Line created with Pick Wall and the Wall is not satisfied.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.UnsatisfiedSupportAssocProp
Constraint between a Line created with Pick Support and the Support is not satisfied.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussSwappedReferences
Truss top reference must be above the bottom reference.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussShiftedReferences
Truss top and bottom references (chains of one or more reference lines) must overlap at least partially in the vertical direction.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussSegmentedReference
Truss reference must form a continuous chain of one or more sketch lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussOverlappingReference
Truss references (chains of one or more reference lines) cannot overlap themselves in the vertical direction.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussMissingReference
Trusses require both a top and a bottom chord reference (chain of one or more reference lines).

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussCrossingReferences
Truss top and bottom references cannot cross.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussClosedReference
Truss references (chains of one or more reference lines) should not form closed loops."

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManySlopesError
There is more than one slope defined.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManySlopes
There is more than one slope defined.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManyElementsInSketch
This sketch is large. Performance will improve if constructed as several independent sketches.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooFewParamsForSketch
The sketched Structural Rebar element has too many segments to be properly parameterized. Please reduce the number of segments.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SuspendedSketchWarn
Highlighted element's sketch could not regenerate and has been suspended.  Select the element and edit its sketch
to fix the problem.  The element will display in magenta until you fix the problem

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SuggestMakingFamilyNonParametric
Performance Warning: This family now contains both labeled dimensions and sketches with many segments. This may hurt performance. To improve performance, create elements that require complex sketches as nested families.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SubregionNoHostSurf
A Subregion cannot be created outside the boundary of a Toposurface.
A Subregion should be completely inside a Toposurface or overlap a Toposurface.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairTooManyConnectedBoundariesError
Stairs require no more than two boundaries (chains of one or more Boundary Lines).

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairTooManyConnectedBoundaries
Stairs require no more than two boundaries (chains of one or more Boundary Lines).

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundaryError
The line representing the top of a riser does not intersect one or both of the boundary lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundary
The line representing the top of a riser does not intersect one or both of the boundary lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundaryError
Stairs require no less than two boundaries (chains of one or more Boundary Lines).

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundary
Stairs require no less than two boundaries (chains of one or more Boundary Lines)."

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughRiserCurvesError
Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughRiserCurves
Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughBoundaryCurvesError
Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughBoundaryCurves
Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairClosedBoundariesError
Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairClosedBoundaries
Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchingInWrongView
Detail sketch is not editable in this view.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchingInTheWrongView
Detail sketch is only editable in [View Type].

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchedRunInvalidPath
Invalid stair path. Stair path should connect both start and end riser, and cross all other risers.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchWasDeleted
Sketch was deleted.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchTooLarge
Sketch is too large.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrainedWarn
Sketch is overconstrained.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrainedError
Sketch is overconstrained.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrained
Sketch is overconstrained.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchFailurePlanes
Sketch is no longer parallel to its defining plane

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SiteCannotDrawSurfaceBoundary
Cannot make surface with specified boundary.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ShortCurveInSketchRoof
The sketch contains an extremely short line.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ShortCurveInSketch
The sketch contains an extremely short line.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingSingleLineLoopLiesOnAxis
The highlighted lines lie on the axis.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingLoopsOnBothSidesOfAxis
All curves must be on the same side of the axis.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesTouchAxis
The highlighted curves touch the axis.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesCrossAxis
The highlighted curves cross the axis.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesCannotFormClosedLoop
Curves cannot form a closed loop.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RunNotEnoughBoundaryCurves
Sketch run require boundaries (chains of one or more Boundary Lines)

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RunInvalidSketch
Invalid sketch, can't create run by this sketch

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecifiedError
Major direction not specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecified
Major direction not specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarManyLoopsError
Rebar Sketch contains more than one loop. Can't create Rebar.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarManyLoops
Rebar Sketch contains more than one loop. Can't create Rebar.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarEmptySketchError
Rebar Sketch is empty. Can't create Rebar.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarEmptySketch
Rebar Sketch is empty. Can't create Rebar.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingNotConnectedError
The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingNotConnected
The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingDoublyConnectedError
Railings hosted on Stairs must form a single, open, connected line.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingDoublyConnected
Railings hosted on Stairs must form a single, open, connected line.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PlanarMultiPlanarShapeInSketch
The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementManyLoops
Sketch contains more than one chain. Can't create Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementEmptySketch
Sketch is empty. Can't create Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathReinforcementClosedLoop
Sketch contains a closed loop. Can't create Path Reinforcement.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathCannotBeClosedLoopPath3d
Path cannot be a closed loop.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathCannotBeClosedLoop
Path cannot be a closed loop.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoopPath3d
Lines must be in closed loops. The highlighted lines are open on one end.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoopError
Lines must be in closed loops. The highlighted lines are open on one end.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoop
Lines must be in closed loops. The highlighted lines are open on one end.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenAreaLoadLoopError
Area Load Sketch can't contain open loops.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenAreaLoadLoop
Area Load Sketch can't contain open loops.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneLoopPath3d
More than one loop not allowed.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneLoop
More than one loop not allowed.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurvePath3d
More than one curve not allowed.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurveError
More than one curve not allowed.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurve
More than one curve not allowed.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCCWLoop
This sketch defines more than one footprint.  Make sure the sketch contains only one outermost loop and that there are no loops inside inner loops.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NonMonotoneRoof
All parts of an extruded roof must face upward. Make sure that no part of the sketch lies below any other part of the sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoPlane
Highlighted geometry no longer determines a plane

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoopsPath3d
Sketch is empty.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoopsError
Sketch is empty.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoLoops
Sketch is empty.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NestedLoops
Cannot have nested loops.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MutipleStairsPathInOneRunFailure
Each stairs run can only have one stairs path.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MoreThanOneAxis
More than one axes of revolution.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.MissingLapInSketch
Rebar Sketch does not have lapped lengths. A circular shaped Rebar needs overlapping legths. Please overlap one of the ends of the circular Rebar Sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyDirectionCurvesError
More than one direction curve specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyDirectionCurves
More than one direction curve specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyCCWLoopsError
Area defined by sketch must be connected.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyCCWLoops
Area defined by sketch must be connected.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopsOutsideFaceSplitterTooShort
Some of the lines drawn lie outside of the boundary of the face being split.  All lines used to split a face must be contained
within the face being split and cannot intersect or overlap any of the boundaries of that face.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopsOutsideFaceSplit
Some of the lines drawn lie outside of the boundary of the face being split.  All lines used to split a face must be contained
within the face being split and cannot intersect or overlap any of the boundaries of that face.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersectPath3d
Lines cannot intersect each other. The highlighted lines currently intersect.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersectError
Lines cannot intersect each other. The highlighted lines currently intersect.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopIntersect
Lines cannot intersect each other. The highlighted lines currently intersect.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlapPath3d
Cannot have overlapping lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlapError
Cannot have overlapping lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlap
Cannot have overlapping lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LandingTwoManyLoops
Sketch landing can only have one closed loop

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LandingNotEnoughBoundaryCurves
Sketch landing require boundaries

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchPath3d
Sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForRoofsoffit
Roof Soffit sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForFloor
Floor sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForCeiling
Ceiling sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForBuildingpad
Pad sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchError
Sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketch
Sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloopFailure
Base sketch for roof is invalid

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloopError
Base sketch for roof is invalid

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloop
Base sketch for roof is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidProfileError
One or more profiles are invalid.  Make sure that every used profile is a closed loop of non-intersecting lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidProfile
One or more profiles are invalid.  Make sure that every used profile is a closed loop of non-intersecting lines.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidElevationSketchError
Elevation Profile sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidElevationSketch
Elevation Profile sketch is invalid.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidCropAreaSketchRegen
Crop area sketch can either be empty or include one closed, not self-intersecting loop.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidCropAreaSketch
Crop area sketch can either be empty or include one closed, not self-intersecting loop.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidAreaLoadSketchError
Area Load has invalid Sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidAreaLoadSketch
Area Load has invalid Sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorManyDirectionCurves
More than one span direction curve specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorDirectionNotSpecified
Structural floor span direction not specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurveError
Cannot add the direction curve in the floor sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorCannotAddDirectionCurve
Cannot add the direction curve in the floor sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.EndsNotOnEdge
Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.EndsNotOnCutFace
Ends of the sketched loop do not lie on the boundary of the face being modified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ElevationSketchNotAllowed
Wall in a family can't have an elevation profile.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ElementsSketchTooLarge
The sketch defining the highlighted element is too large.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.DifferentOffsets
Adjacent slope-defining lines must have identical eave heights; the highlighted lines do not.  You can use the Align Eaves tool to have the eaves aligned for you.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveTooShort
Line is too short.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveIntersectsSplitFace
The highlighted line intersects the boundary of the face being split.  To split a face at its border, use an open loop that
ends on the boundary of the face.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveIntersectsCutFace
The highlighted line intersects the boundary of the face being modified.  To modify a cut face, use open loops that end on the
existing boundary without intersecting or overlapping existing edges.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CurveFromPickedFailed
Can't create boundary from pick.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConvertSplineToLineFailed
Failed to convert spline to straight line

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ContainedInOtherLoops
When creating an opening, you cannot sketch loops within other loops. The highlighted loop(s) are contained within another loop.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConstantHeightNotParallelError
Constant-height-defining lines must be parallel.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConstantHeightNotParallel
Constant-height-defining lines must be parallel.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ClosedProfileRoof
Extrusion roof sketch must be open. The roof's thickness and material composition are defined in its type.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CircleMultiPlanarShapeInSketch
A circle can't be converted to multiplanar shape.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotHaveArcsPath3d
Sorry, we can't use arcs here.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotHaveArcs
Sorry, we can't use arcs here.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotGetSketchReferences
Cannot find references to dimension sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotDrawProfileRoof
Can't make footprint roof.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotDrawExtrusionRoof
Can't make extruded roof.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotConvertSketch
Can't convert Sketch to Rebar Shape.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevationWarn
Can't compute Railings Elevation Profile

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevationError
Can't compute Railings Elevation Profile.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevation
Can't compute Railings Elevation Profile.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeWorkplaneVisibility
Can't change Work Plane Visibility.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeUserSketchPlaneError
Can't change plane of [Element Name] Sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeUserSketchPlane
Can't change plane of [Element Name] Sketch.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BuildingPadNoSurfaceError
A Pad can't extend beyond the edge of a Toposurface.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BuildingPadNoSurface
A Pad can't extend beyond the edge of a Toposurface.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetTooShortSegments
A segment in the bend profile is too short to apply the wire bend diameter. The bent fabric sheet of the selected type cannot be placed in a host. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetManyLoopsInSketch
The bend profile cannot contain two or more disconnected segments. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetLinesOverlapOrIntersect
Segments in a bend profile cannot overlap, intersect, or be collinearly contiguous. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetInvalidElementInSketch
Arcs in a bend profile must be separated from one another with a connected straight segment. The bend profile cannot start or end with an arc. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetEmptySketch
The bend profile requires at least one segment to be placed in a host. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetClosedLoopInSketch
The bend profile cannot contain a closed loop. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BeamDirectionNotSpecifiedError
Beam direction not specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BeamDirectionNotSpecified
Beam direction not specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BadRailingsProfile
Rail profile must have one closed loop. Wrong profile will not be shown in profiles list for rail definition.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BadNosingProfile
Stairs nosing profile must have one loop. Wrong profile will not be shown in profiles list in Stairs Type properties.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.AxisNotSpecified
Axis of revolution not specified.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.AreaLoadNoForce
Area Load can't have all force components equal to zero.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures
Failures about Sketch.